INSERT INTO ideas (title, description, votes) VALUES
('Идея A', 'Описание идеи A', 0),
('Идея B', 'Описание идеи B', 0),
('Идея C', 'Описание идеи C', 0),
('Идея D', 'Описание идеи D', 0),
('Идея E', 'Описание идеи E', 0),
('Идея F', 'Описание идеи F', 0),
('Идея A1', 'Описание идеи A1', 0),
('Идея B1', 'Описание идеи B1', 0),
('Идея C1', 'Описание идеи C1', 0),
('Идея D1', 'Описание идеи D1', 0),
('Идея E1', 'Описание идеи E1', 0),
('Идея F1', 'Описание идеи F1', 0),
('Идея A2', 'Описание идеи A2', 0),
('Идея B2', 'Описание идеи B2', 0),
('Идея C2', 'Описание идеи C2', 0),
('Идея D2', 'Описание идеи D2', 0),
('Идея E2', 'Описание идеи E2', 0),
('Идея F2', 'Описание идеи F2', 0);

-- (необязательно) примеры голосов от одного IP
-- INSERT INTO ip_counters (ip, cnt) VALUES
-- ('192.0.2.1', 2)
-- ON CONFLICT (ip) DO NOTHING;

-- INSERT INTO votes (idea_id, ip)
-- VALUES
-- (1, '192.0.2.1'),
-- (2, '192.0.2.1')
-- ON CONFLICT DO NOTHING;

-- И не забудь при вставке голосов обновлять поле votes:
-- UPDATE ideas SET votes = votes + 1 WHERE id = 1;
-- UPDATE ideas SET votes = votes + 1 WHERE id = 2;
